test_shopinvader_payment/tests/cassettes/TestShopinvaderPaymentStripe.test_confirm_payment_two_step.yaml

interactions:
- request:
    body: !!python/unicode 'capture_method=automatic&description=Fake&confirm=True&payment_method=pm_card_threeDSecure2Required&confirmation_method=manual&currency=EUR&amount=500&metadata[reference]=Fake'
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['175']
      Content-Type: [application/x-www-form-urlencoded]
      Idempotency-Key: [771d2eb3-f8e5-40f9-9047-4af50e3aa9a7]
      User-Agent: [Stripe/v1 PythonBindings/2.35.1]
      X-Stripe-Client-Telemetry: ['{"last_request_metrics": {"request_duration_ms":
          1553, "request_id": "req_IV62O2fTr5wiFa"}}']
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux dev-cimade 5.3.0-7625-generic #27~1576774560~19.10~f432cd8-Ubuntu
          SMP Thu Dec 19 20:35:37 UTC  x86_64 ", "lang_version": "2.7.9", "platform":
          "Linux-5.3.0-7625-generic-x86_64-with-debian-8.11", "bindings_version":
          "2.35.1"}']
    method: POST
    uri: https://api.stripe.com/v1/payment_intents
  response:
    body: {string: !!python/unicode '{"next_action": {"use_stripe_sdk": {"directory_server_encryption":
        {"root_certificate_authorities": ["-----BEGIN CERTIFICATE-----\nMIIDojCCAoqgAwIBAgIQE4Y1TR0/BvLB+WUF1ZAcYjANBgkqhkiG9w0BAQUFADBr\nMQswCQYDVQQGEwJVUzENMAsGA1UEChMEVklTQTEvMC0GA1UECxMmVmlzYSBJbnRl\ncm5hdGlvbmFsIFNlcnZpY2UgQXNzb2NpYXRpb24xHDAaBgNVBAMTE1Zpc2EgZUNv\nbW1lcmNlIFJvb3QwHhcNMDIwNjI2MDIxODM2WhcNMjIwNjI0MDAxNjEyWjBrMQsw\nCQYDVQQGEwJVUzENMAsGA1UEChMEVklTQTEvMC0GA1UECxMmVmlzYSBJbnRlcm5h\ndGlvbmFsIFNlcnZpY2UgQXNzb2NpYXRpb24xHDAaBgNVBAMTE1Zpc2EgZUNvbW1l\ncmNlIFJvb3QwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCvV95WHm6h\n2mCxlCfLF9sHP4CFT8icttD0b0/Pmdjh28JIXDqsOTPHH2qLJj0rNfVIsZHBAk4E\nlpF7sDPwsRROEW+1QK8bRaVK7362rPKgH1g/EkZgPI2h4H3PVz4zHvtH8aoVlwdV\nZqW1LS7YgFmypw23RuwhY/81q6UCzyr0TP579ZRdhE2o8mCP2w4lPJ9zcc+U30rq\n299yOIzzlr3xF7zSujtFWsan9sYXiwGd/BmoKoMWuDpI/k4+oKsGGelT84ATB+0t\nvz8KPFUgOSwsAGl0lUq8ILKpeeUYiZGo3BxN77t+Nwtd/jmliFKMAGzsGHxBvfaL\ndXe6YJ2E5/4tAgMBAAGjQjBAMA8GA1UdEwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQD\nAgEGMB0GA1UdDgQWBBQVOIMPPyw/cDMezUb+B4wg4NfDtzANBgkqhkiG9w0BAQUF\nAAOCAQEAX/FBfXxcCLkr4NWSR/pnXKUTwwMhmytMiUbPWU3J/qVAtmPN3XEolWcR\nzCSs00Rsca4BIGsDoo8Ytyk6feUWYFN4PMCvFYP3j1IzJL1kk5fui/fbGKhtcbP3\nLBfQdCVp9/5rPJS+TUtBjE7ic9DjkCJzQ83z7+pzzkWKsKZJ/0x9nXGIxHYdkFsd\n7v3M9+79YKWxehZx0RbQfBI8bGmX265fOZpwLwU8GUYEmSA20GBuYQa7FkKMcPcw\n++DbZqMAAb3mLNqRX6BGi01qnD093QVG/na/oAo85ADmJ7f/hC3euiInlhBx6yLt\n398znM/jra6O1I7mT1GvFpLgXPYHDw==\n-----END
        CERTIFICATE-----\n"], "directory_server_id": "A000000003", "certificate":
        "-----BEGIN CERTIFICATE-----\nMIIFrjCCBJagAwIBAgIQB2rJmsHVwbONd36WP9QPrTANBgkqhkiG9w0BAQsFADBx\nMQswCQYDVQQGEwJVUzENMAsGA1UEChMEVklTQTEvMC0GA1UECxMmVmlzYSBJbnRl\ncm5hdGlvbmFsIFNlcnZpY2UgQXNzb2NpYXRpb24xIjAgBgNVBAMTGVZpc2EgZUNv\nbW1lcmNlIElzc3VpbmcgQ0EwHhcNMTcxMTAyMjIyMzEwWhcNMjAxMTAzMDAyMzEw\nWjCBoTEYMBYGA1UEBxMPSGlnaGxhbmRzIFJhbmNoMREwDwYDVQQIEwhDb2xvcmFk\nbzELMAkGA1UEBhMCVVMxDTALBgNVBAoTBFZJU0ExLzAtBgNVBAsTJlZpc2EgSW50\nZXJuYXRpb25hbCBTZXJ2aWNlIEFzc29jaWF0aW9uMSUwIwYDVQQDExwzZHMyLnJz\nYS5lbmNyeXB0aW9uLnZpc2EuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB\nCgKCAQEAst+HGfPPsX3p6HHEQ9YzourlQj16Nscmm13Cp7cZe4dZB2oWnJqZ7oh/\npEoEoOAxBw1x4NFgXKTKdHAeu3VBNVw8SwMTdIC+X16VV+3VIyPbUvJXFp3QoR8W\nUwPB3F1Lb9SMFNS95boYDZKIOdPW0cP1dRi7pFugsBUZDCP/H3nFfBFHMCBoga+P\n3AHGj5y8RVpv0hS9jaIsYjX+i58B61OGCB7D0AiADNZJuFzw2+xpNkt6NJJF66FP\nO8qIh8xR2xGVDf7TtCbss/CugLRgSqKab9YRB8/TBTcy5bxj6O8HD6aL2zGLcMY9\ndCobXxCodLEtMjJdVL8N+iZrsI2gtwIDAQABo4ICDzCCAgswEwYDVR0lBAwwCgYI\nKwYBBQUHAwEwZQYIKwYBBQUHAQEEWTBXMCUGCCsGAQUFBzABhhlodHRwOi8vb2Nz\ncC52aXNhLmNvbS9vY3NwMC4GCCsGAQUFBzAChiJodHRwOi8vZW5yb2xsLnZpc2Fj\nYS5jb20vZWNvbW0uY2VyMB8GA1UdIwQYMBaAFN/DKlUuL0I6ekCdkqD3R3nXj4eK\nMAwGA1UdEwEB/wQCMAAwgcoGA1UdHwSBwjCBvzAooCagJIYiaHR0cDovL0Vucm9s\nbC52aXNhY2EuY29tL2VDb21tLmNybDCBkqCBj6CBjIaBiWxkYXA6Ly9FbnJvbGwu\ndmlzYWNhLmNvbTozODkvY249VmlzYSBlQ29tbWVyY2UgSXNzdWluZyBDQSxjPVVT\nLG91PVZpc2EgSW50ZXJuYXRpb25hbCBTZXJ2aWNlIEFzc29jaWF0aW9uLG89VklT\nQT9jZXJ0aWZpY2F0ZVJldm9jYXRpb25MaXN0MA4GA1UdDwEB/wQEAwIFoDAnBgNV\nHREEIDAeghwzZHMyLnJzYS5lbmNyeXB0aW9uLnZpc2EuY29tMB0GA1UdDgQWBBT8\nm2pDtUtY13f/3NCOmexHavP5zDA5BgNVHSAEMjAwMC4GBWeBAwEBMCUwIwYIKwYB\nBQUHAgEWF2h0dHA6Ly93d3cudmlzYS5jb20vcGtpMA0GCSqGSIb3DQEBCwUAA4IB\nAQCcCUhU7KnHUDuLXqwSuzC8lWWCcEqPRgPPzY3mgBUg9ya0p+v7QF2BG77tpygK\nE2yDPkOE8trzYeMi7TCuvKgZvUXDSOka8SId9QleMBlo2pzNi0vKKBG8+E7qmGaf\netQHVaoFvhg24/e7y8q89VYNKfLXn8TWMUOJdTQoNP+4bHcCnBvWWUcI2LlyEog1\n2FDSG8hgP3cpw+0B2Hace9BQGR7ZgTIJAANEHZ54QGOYdxZEcDS5IEpKZlN8INs/\nNKJyCkqP09VA4NO/WHaGFAXtgoLmjlA9Kal+4ieJPKijVDxcHVv/uPSfVQJ0/vCa\nudJGOXV9q4VteupwLxfOGW8w\n-----END
        CERTIFICATE-----\n", "algorithm": "RSA"}, "three_d_secure_2_source": "src_1G2xxY2eZvKYlo2C06BMkcD7",
        "type": "stripe_3ds2_fingerprint", "server_transaction_id": "2eaa4ea4-5ed3-4408-bb5d-f7338cbc345c",
        "three_ds_optimizations": "k", "three_ds_method_url": "", "directory_server_name":
        "visa"}, "type": "use_stripe_sdk"}, "amount_received": 0, "payment_method":
        "pm_1G2xxY2eZvKYlo2CRXL3Qxuj", "livemode": false, "currency": "eur", "invoice":
        null, "id": "pi_1G2xxY2eZvKYlo2C0ydpKdiF", "last_payment_error": null, "on_behalf_of":
        null, "transfer_group": null, "source": null, "review": null, "statement_descriptor":
        null, "application": null, "receipt_email": null, "metadata": {"reference":
        "Fake"}, "status": "succeeded", "capture_method": "automatic", "description":
        "Fake", "payment_method_options": {"card": {"installments": null, "request_three_d_secure":
        "automatic"}}, "confirmation_method": "manual", "object": "payment_intent",
        "statement_descriptor_suffix": null, "transfer_data": null, "setup_future_usage":
        null, "customer": null, "application_fee_amount": null, "created": 1579517900,
        "canceled_at": null, "shipping": null, "charges": {"has_more": false, "total_count":
        0, "object": "list", "data": [], "url": "/v1/charges?payment_intent=pi_1G2xxY2eZvKYlo2C0ydpKdiF"},
        "amount": 500, "amount_capturable": 0, "payment_method_types": ["card"], "client_secret":
        "pi_1G2xxY2eZvKYlo2C0ydpKdiF_secret_mCE03JuWcxqAa5maRtOXy6QJW", "cancellation_reason":
        null}'}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['5282']
      content-type: [application/json]
      date: ['Mon, 20 Jan 2020 10:58:20 GMT']
      idempotency-key: [771d2eb3-f8e5-40f9-9047-4af50e3aa9a7]
      original-request: [req_nEKAzpBLJhL8nO]
      request-id: [req_nEKAzpBLJhL8nO]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-should-retry: ['false']
      stripe-version: ['2019-02-19']
    status: {code: 200, message: OK}
- request:
    body: null
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['0']
      Content-Type: [application/x-www-form-urlencoded]
      Idempotency-Key: [fe825bf8-4d7d-4ffe-9b06-eca0864d1d74]
      User-Agent: [Stripe/v1 PythonBindings/2.35.1]
      X-Stripe-Client-Telemetry: ['{"last_request_metrics": {"request_duration_ms":
          1062, "request_id": "req_nEKAzpBLJhL8nO"}}']
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux dev-cimade 5.3.0-7625-generic #27~1576774560~19.10~f432cd8-Ubuntu
          SMP Thu Dec 19 20:35:37 UTC  x86_64 ", "lang_version": "2.7.9", "platform":
          "Linux-5.3.0-7625-generic-x86_64-with-debian-8.11", "bindings_version":
          "2.35.1"}']
    method: POST
    uri: https://api.stripe.com/v1/payment_intents/pi_1G2xxY2eZvKYlo2C0ydpKdiF/confirm
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"pi_1G2xxY2eZvKYlo2C0ydpKdiF\"\
        ,\n  \"object\": \"payment_intent\",\n  \"amount\": 500,\n  \"amount_capturable\"\
        : 0,\n  \"amount_received\": 0,\n  \"application\": null,\n  \"application_fee_amount\"\
        : null,\n  \"canceled_at\": null,\n  \"cancellation_reason\": null,\n  \"\
        capture_method\": \"automatic\",\n  \"charges\": {\n    \"object\": \"list\"\
        ,\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\"\
        : 0,\n    \"url\": \"/v1/charges?payment_intent=pi_1G2xxY2eZvKYlo2C0ydpKdiF\"\
        \n  },\n  \"client_secret\": \"pi_1G2xxY2eZvKYlo2C0ydpKdiF_secret_mCE03JuWcxqAa5maRtOXy6QJW\"\
        ,\n  \"confirmation_method\": \"manual\",\n  \"created\": 1579517900,\n  \"\
        currency\": \"eur\",\n  \"customer\": null,\n  \"description\": \"Fake\",\n\
        \  \"invoice\": null,\n  \"last_payment_error\": null,\n  \"livemode\": false,\n\
        \  \"metadata\": {\n    \"reference\": \"Fake\"\n  },\n  \"next_action\":\
        \ {\n    \"type\": \"use_stripe_sdk\",\n    \"use_stripe_sdk\": {\n      \"\
        type\": \"stripe_3ds2_fingerprint\",\n      \"three_d_secure_2_source\": \"\
        src_1G2xxY2eZvKYlo2C06BMkcD7\",\n      \"directory_server_name\": \"visa\"\
        ,\n      \"server_transaction_id\": \"2eaa4ea4-5ed3-4408-bb5d-f7338cbc345c\"\
        ,\n      \"three_ds_method_url\": \"\",\n      \"three_ds_optimizations\"\
        : \"k\",\n      \"directory_server_encryption\": {\n        \"directory_server_id\"\
        : \"A000000003\",\n        \"algorithm\": \"RSA\",\n        \"certificate\"\
        : \"-----BEGIN CERTIFICATE-----\\nMIIFrjCCBJagAwIBAgIQB2rJmsHVwbONd36WP9QPrTANBgkqhkiG9w0BAQsFADBx\\\
        nMQswCQYDVQQGEwJVUzENMAsGA1UEChMEVklTQTEvMC0GA1UECxMmVmlzYSBJbnRl\\ncm5hdGlvbmFsIFNlcnZpY2UgQXNzb2NpYXRpb24xIjAgBgNVBAMTGVZpc2EgZUNv\\\
        nbW1lcmNlIElzc3VpbmcgQ0EwHhcNMTcxMTAyMjIyMzEwWhcNMjAxMTAzMDAyMzEw\\nWjCBoTEYMBYGA1UEBxMPSGlnaGxhbmRzIFJhbmNoMREwDwYDVQQIEwhDb2xvcmFk\\\
        nbzELMAkGA1UEBhMCVVMxDTALBgNVBAoTBFZJU0ExLzAtBgNVBAsTJlZpc2EgSW50\\nZXJuYXRpb25hbCBTZXJ2aWNlIEFzc29jaWF0aW9uMSUwIwYDVQQDExwzZHMyLnJz\\\
        nYS5lbmNyeXB0aW9uLnZpc2EuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB\\nCgKCAQEAst+HGfPPsX3p6HHEQ9YzourlQj16Nscmm13Cp7cZe4dZB2oWnJqZ7oh/\\\
        npEoEoOAxBw1x4NFgXKTKdHAeu3VBNVw8SwMTdIC+X16VV+3VIyPbUvJXFp3QoR8W\\nUwPB3F1Lb9SMFNS95boYDZKIOdPW0cP1dRi7pFugsBUZDCP/H3nFfBFHMCBoga+P\\\
        n3AHGj5y8RVpv0hS9jaIsYjX+i58B61OGCB7D0AiADNZJuFzw2+xpNkt6NJJF66FP\\nO8qIh8xR2xGVDf7TtCbss/CugLRgSqKab9YRB8/TBTcy5bxj6O8HD6aL2zGLcMY9\\\
        ndCobXxCodLEtMjJdVL8N+iZrsI2gtwIDAQABo4ICDzCCAgswEwYDVR0lBAwwCgYI\\nKwYBBQUHAwEwZQYIKwYBBQUHAQEEWTBXMCUGCCsGAQUFBzABhhlodHRwOi8vb2Nz\\\
        ncC52aXNhLmNvbS9vY3NwMC4GCCsGAQUFBzAChiJodHRwOi8vZW5yb2xsLnZpc2Fj\\nYS5jb20vZWNvbW0uY2VyMB8GA1UdIwQYMBaAFN/DKlUuL0I6ekCdkqD3R3nXj4eK\\\
        nMAwGA1UdEwEB/wQCMAAwgcoGA1UdHwSBwjCBvzAooCagJIYiaHR0cDovL0Vucm9s\\nbC52aXNhY2EuY29tL2VDb21tLmNybDCBkqCBj6CBjIaBiWxkYXA6Ly9FbnJvbGwu\\\
        ndmlzYWNhLmNvbTozODkvY249VmlzYSBlQ29tbWVyY2UgSXNzdWluZyBDQSxjPVVT\\nLG91PVZpc2EgSW50ZXJuYXRpb25hbCBTZXJ2aWNlIEFzc29jaWF0aW9uLG89VklT\\\
        nQT9jZXJ0aWZpY2F0ZVJldm9jYXRpb25MaXN0MA4GA1UdDwEB/wQEAwIFoDAnBgNV\\nHREEIDAeghwzZHMyLnJzYS5lbmNyeXB0aW9uLnZpc2EuY29tMB0GA1UdDgQWBBT8\\\
        nm2pDtUtY13f/3NCOmexHavP5zDA5BgNVHSAEMjAwMC4GBWeBAwEBMCUwIwYIKwYB\\nBQUHAgEWF2h0dHA6Ly93d3cudmlzYS5jb20vcGtpMA0GCSqGSIb3DQEBCwUAA4IB\\\
        nAQCcCUhU7KnHUDuLXqwSuzC8lWWCcEqPRgPPzY3mgBUg9ya0p+v7QF2BG77tpygK\\nE2yDPkOE8trzYeMi7TCuvKgZvUXDSOka8SId9QleMBlo2pzNi0vKKBG8+E7qmGaf\\\
        netQHVaoFvhg24/e7y8q89VYNKfLXn8TWMUOJdTQoNP+4bHcCnBvWWUcI2LlyEog1\\n2FDSG8hgP3cpw+0B2Hace9BQGR7ZgTIJAANEHZ54QGOYdxZEcDS5IEpKZlN8INs/\\\
        nNKJyCkqP09VA4NO/WHaGFAXtgoLmjlA9Kal+4ieJPKijVDxcHVv/uPSfVQJ0/vCa\\nudJGOXV9q4VteupwLxfOGW8w\\\
        n-----END CERTIFICATE-----\\n\",\n        \"root_certificate_authorities\"\
        : [\n          \"-----BEGIN CERTIFICATE-----\\nMIIDojCCAoqgAwIBAgIQE4Y1TR0/BvLB+WUF1ZAcYjANBgkqhkiG9w0BAQUFADBr\\\
        nMQswCQYDVQQGEwJVUzENMAsGA1UEChMEVklTQTEvMC0GA1UECxMmVmlzYSBJbnRl\\ncm5hdGlvbmFsIFNlcnZpY2UgQXNzb2NpYXRpb24xHDAaBgNVBAMTE1Zpc2EgZUNv\\\
        nbW1lcmNlIFJvb3QwHhcNMDIwNjI2MDIxODM2WhcNMjIwNjI0MDAxNjEyWjBrMQsw\\nCQYDVQQGEwJVUzENMAsGA1UEChMEVklTQTEvMC0GA1UECxMmVmlzYSBJbnRlcm5h\\\
        ndGlvbmFsIFNlcnZpY2UgQXNzb2NpYXRpb24xHDAaBgNVBAMTE1Zpc2EgZUNvbW1l\\ncmNlIFJvb3QwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCvV95WHm6h\\\
        n2mCxlCfLF9sHP4CFT8icttD0b0/Pmdjh28JIXDqsOTPHH2qLJj0rNfVIsZHBAk4E\\nlpF7sDPwsRROEW+1QK8bRaVK7362rPKgH1g/EkZgPI2h4H3PVz4zHvtH8aoVlwdV\\\
        nZqW1LS7YgFmypw23RuwhY/81q6UCzyr0TP579ZRdhE2o8mCP2w4lPJ9zcc+U30rq\\n299yOIzzlr3xF7zSujtFWsan9sYXiwGd/BmoKoMWuDpI/k4+oKsGGelT84ATB+0t\\\
        nvz8KPFUgOSwsAGl0lUq8ILKpeeUYiZGo3BxN77t+Nwtd/jmliFKMAGzsGHxBvfaL\\ndXe6YJ2E5/4tAgMBAAGjQjBAMA8GA1UdEwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQD\\\
        nAgEGMB0GA1UdDgQWBBQVOIMPPyw/cDMezUb+B4wg4NfDtzANBgkqhkiG9w0BAQUF\\nAAOCAQEAX/FBfXxcCLkr4NWSR/pnXKUTwwMhmytMiUbPWU3J/qVAtmPN3XEolWcR\\\
        nzCSs00Rsca4BIGsDoo8Ytyk6feUWYFN4PMCvFYP3j1IzJL1kk5fui/fbGKhtcbP3\\nLBfQdCVp9/5rPJS+TUtBjE7ic9DjkCJzQ83z7+pzzkWKsKZJ/0x9nXGIxHYdkFsd\\\
        n7v3M9+79YKWxehZx0RbQfBI8bGmX265fOZpwLwU8GUYEmSA20GBuYQa7FkKMcPcw\\n++DbZqMAAb3mLNqRX6BGi01qnD093QVG/na/oAo85ADmJ7f/hC3euiInlhBx6yLt\\\
        n398znM/jra6O1I7mT1GvFpLgXPYHDw==\\n-----END CERTIFICATE-----\\n\"\n     \
        \   ]\n      }\n    }\n  },\n  \"on_behalf_of\": null,\n  \"payment_method\"\
        : \"pm_1G2xxY2eZvKYlo2CRXL3Qxuj\",\n  \"payment_method_options\": {\n    \"\
        card\": {\n      \"installments\": null,\n      \"request_three_d_secure\"\
        : \"automatic\"\n    }\n  },\n  \"payment_method_types\": [\n    \"card\"\n\
        \  ],\n  \"receipt_email\": null,\n  \"review\": null,\n  \"setup_future_usage\"\
        : null,\n  \"shipping\": null,\n  \"source\": null,\n  \"statement_descriptor\"\
        : null,\n  \"statement_descriptor_suffix\": null,\n  \"status\": \"requires_action\"\
        ,\n  \"transfer_data\": null,\n  \"transfer_group\": null\n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['5282']
      content-type: [application/json]
      date: ['Mon, 20 Jan 2020 10:58:21 GMT']
      idempotency-key: [fe825bf8-4d7d-4ffe-9b06-eca0864d1d74]
      original-request: [req_jRclddneVfsGk6]
      request-id: [req_jRclddneVfsGk6]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-should-retry: ['false']
      stripe-version: ['2019-02-19']
    status: {code: 200, message: OK}
version: 1
